#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show summary</summary>

```# google_compute_address.public_address will be created
# google_compute_firewall.firewall-allow-external will be created
# google_compute_firewall.firewall-allow-health-check will be created
# google_compute_firewall.firewall-allow-internal will be created
# google_compute_firewall.firewall-allow-worker-0-nodeport will be created
# google_compute_forwarding_rule.forwarding-rule will be created
# google_compute_http_health_check.kubernetes will be created
# google_compute_instance.controller[0] will be created
# google_compute_instance.worker[0] will be created
# google_compute_instance.worker[1] will be created
# google_compute_instance.worker[2] will be created
# google_compute_network.vpc_network will be created
# google_compute_route.route[0] will be created
# google_compute_route.route[1] will be created
# google_compute_route.route[2] will be created
# google_compute_subnetwork.subnet will be created
# google_compute_target_pool.target-pool will be created
# kubernetes_deployment.nginx will be created
# kubernetes_service.nginx will be created
# tls_cert_request.admin will be created
# tls_cert_request.api-server will be created
# tls_cert_request.controller will be created
# tls_cert_request.proxy will be created
# tls_cert_request.scheduler will be created
# tls_cert_request.service-account will be created
# tls_locally_signed_cert.admin will be created
# tls_locally_signed_cert.api-server will be created
# tls_locally_signed_cert.controller will be created
# tls_locally_signed_cert.proxy will be created
# tls_locally_signed_cert.scheduler will be created
# tls_locally_signed_cert.service-account will be created
# tls_private_key.admin will be created
# tls_private_key.api-server will be created
# tls_private_key.ca will be created
# tls_private_key.controller will be created
# tls_private_key.proxy will be created
# tls_private_key.scheduler will be created
# tls_private_key.service-account will be created
# tls_private_key.ssh-key will be created
# tls_self_signed_cert.ca will be created
```

</details>

<details><summary>Show detail</summary>

```terraform
Acquiring state lock. This may take a few moments...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.


------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_address.public_address will be created
  + resource "google_compute_address" "public_address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "kubernetes-the-hard-way"
      + network_tier       = (known after apply)
      + project            = (known after apply)
      + purpose            = (known after apply)
      + region             = "australia-southeast1"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # google_compute_firewall.firewall-allow-external will be created
  + resource "google_compute_firewall" "firewall-allow-external" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "kubernetes-the-hard-way-allow-external"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]

      + allow {
          + ports    = [
              + "22",
              + "6443",
            ]
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "icmp"
        }
    }

  # google_compute_firewall.firewall-allow-health-check will be created
  + resource "google_compute_firewall" "firewall-allow-health-check" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "kubernetes-the-hard-way-allow-health-check"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "209.85.152.0/22",
          + "209.85.204.0/22",
          + "35.191.0.0/16",
        ]

      + allow {
          + ports    = []
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.firewall-allow-internal will be created
  + resource "google_compute_firewall" "firewall-allow-internal" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "kubernetes-the-hard-way-allow-internal"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.200.0.0/16",
          + "10.240.0.0/24",
        ]

      + allow {
          + ports    = []
          + protocol = "icmp"
        }
      + allow {
          + ports    = []
          + protocol = "tcp"
        }
      + allow {
          + ports    = []
          + protocol = "udp"
        }
    }

  # google_compute_firewall.firewall-allow-worker-0-nodeport will be created
  + resource "google_compute_firewall" "firewall-allow-worker-0-nodeport" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + id                 = (known after apply)
      + name               = "kubernetes-the-hard-way-allow-nginx-service"
      + network            = (known after apply)
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)

      + allow {
          + ports    = [
              + "30201",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_forwarding_rule.forwarding-rule will be created
  + resource "google_compute_forwarding_rule" "forwarding-rule" {
      + creation_timestamp    = (known after apply)
      + id                    = (known after apply)
      + ip_address            = (known after apply)
      + ip_protocol           = (known after apply)
      + ip_version            = (known after apply)
      + load_balancing_scheme = "EXTERNAL"
      + name                  = "kubernetes-forwarding-rule"
      + network               = (known after apply)
      + network_tier          = (known after apply)
      + port_range            = "6443"
      + project               = (known after apply)
      + region                = "australia-southeast1"
      + self_link             = (known after apply)
      + service_name          = (known after apply)
      + subnetwork            = (known after apply)
      + target                = (known after apply)
    }

  # google_compute_http_health_check.kubernetes will be created
  + resource "google_compute_http_health_check" "kubernetes" {
      + check_interval_sec  = 5
      + creation_timestamp  = (known after apply)
      + description         = "Kubernetes Health Check"
      + healthy_threshold   = 2
      + host                = "kubernetes.default.svc.cluster.local"
      + id                  = (known after apply)
      + name                = "kubernetes"
      + port                = 80
      + project             = (known after apply)
      + request_path        = "/healthz"
      + self_link           = (known after apply)
      + timeout_sec         = 5
      + unhealthy_threshold = 2
    }

  # google_compute_instance.controller[0] will be created
  + resource "google_compute_instance" "controller" {
      + can_ip_forward          = true
      + cpu_platform            = (known after apply)
      + deletion_protection     = false
      + guest_accelerator       = (known after apply)
      + id                      = (known after apply)
      + instance_id             = (known after apply)
      + label_fingerprint       = (known after apply)
      + machine_type            = "e2-micro"
      + metadata_fingerprint    = (known after apply)
      + metadata_startup_script = (known after apply)
      + min_cpu_platform        = (known after apply)
      + name                    = "controller-0"
      + project                 = (known after apply)
      + self_link               = (known after apply)
      + tags                    = [
          + "controller",
          + "kubernetes-the-hard-way",
        ]
      + tags_fingerprint        = (known after apply)
      + zone                    = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.10"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[0] will be created
  + resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata             = (known after apply)
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "worker-0"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes-the-hard-way",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.20"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[1] will be created
  + resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata             = (known after apply)
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "worker-1"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes-the-hard-way",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.21"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_instance.worker[2] will be created
  + resource "google_compute_instance" "worker" {
      + can_ip_forward       = true
      + cpu_platform         = (known after apply)
      + deletion_protection  = false
      + guest_accelerator    = (known after apply)
      + id                   = (known after apply)
      + instance_id          = (known after apply)
      + label_fingerprint    = (known after apply)
      + machine_type         = "e2-micro"
      + metadata             = (known after apply)
      + metadata_fingerprint = (known after apply)
      + min_cpu_platform     = (known after apply)
      + name                 = "worker-2"
      + project              = (known after apply)
      + self_link            = (known after apply)
      + tags                 = [
          + "kubernetes-the-hard-way",
          + "worker",
        ]
      + tags_fingerprint     = (known after apply)
      + zone                 = "australia-southeast1-a"

      + boot_disk {
          + auto_delete                = true
          + device_name                = (known after apply)
          + disk_encryption_key_sha256 = (known after apply)
          + kms_key_self_link          = (known after apply)
          + mode                       = "READ_WRITE"
          + source                     = (known after apply)

          + initialize_params {
              + image  = "ubuntu-os-cloud/ubuntu-2004-lts"
              + labels = (known after apply)
              + size   = 200
              + type   = (known after apply)
            }
        }

      + network_interface {
          + name               = (known after apply)
          + network            = (known after apply)
          + network_ip         = "10.240.0.22"
          + subnetwork         = (known after apply)
          + subnetwork_project = (known after apply)

          + access_config {
              + nat_ip       = (known after apply)
              + network_tier = (known after apply)
            }
        }

      + scheduling {
          + automatic_restart   = (known after apply)
          + on_host_maintenance = (known after apply)
          + preemptible         = (known after apply)

          + node_affinities {
              + key      = (known after apply)
              + operator = (known after apply)
              + values   = (known after apply)
            }
        }

      + service_account {
          + email  = (known after apply)
          + scopes = [
              + "https://www.googleapis.com/auth/compute",
              + "https://www.googleapis.com/auth/devstorage.read_only",
              + "https://www.googleapis.com/auth/logging.write",
              + "https://www.googleapis.com/auth/monitoring",
              + "https://www.googleapis.com/auth/service.management.readonly",
              + "https://www.googleapis.com/auth/servicecontrol",
            ]
        }
    }

  # google_compute_network.vpc_network will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + ipv4_range                      = (known after apply)
      + name                            = "kubernetes-the-hard-way"
      + project                         = (known after apply)
      + routing_mode                    = (known after apply)
      + self_link                       = (known after apply)
    }

  # google_compute_route.route[0] will be created
  + resource "google_compute_route" "route" {
      + dest_range       = "10.200.0.0/24"
      + id               = (known after apply)
      + name             = "kubernetes-route-10-200-0-0-24"
      + network          = "kubernetes-the-hard-way"
      + next_hop_ip      = "10.240.0.20"
      + next_hop_network = (known after apply)
      + priority         = 1000
      + project          = (known after apply)
      + self_link        = (known after apply)
    }

  # google_compute_route.route[1] will be created
  + resource "google_compute_route" "route" {
      + dest_range       = "10.200.1.0/24"
      + id               = (known after apply)
      + name             = "kubernetes-route-10-200-1-0-24"
      + network          = "kubernetes-the-hard-way"
      + next_hop_ip      = "10.240.0.21"
      + next_hop_network = (known after apply)
      + priority         = 1000
      + project          = (known after apply)
      + self_link        = (known after apply)
    }

  # google_compute_route.route[2] will be created
  + resource "google_compute_route" "route" {
      + dest_range       = "10.200.2.0/24"
      + id               = (known after apply)
      + name             = "kubernetes-route-10-200-2-0-24"
      + network          = "kubernetes-the-hard-way"
      + next_hop_ip      = "10.240.0.22"
      + next_hop_network = (known after apply)
      + priority         = 1000
      + project          = (known after apply)
      + self_link        = (known after apply)
    }

  # google_compute_subnetwork.subnet will be created
  + resource "google_compute_subnetwork" "subnet" {
      + creation_timestamp = (known after apply)
      + enable_flow_logs   = (known after apply)
      + fingerprint        = (known after apply)
      + gateway_address    = (known after apply)
      + id                 = (known after apply)
      + ip_cidr_range      = "10.240.0.0/24"
      + name               = "kubernetes"
      + network            = (known after apply)
      + project            = (known after apply)
      + region             = "australia-southeast1"
      + secondary_ip_range = (known after apply)
      + self_link          = (known after apply)
    }

  # google_compute_target_pool.target-pool will be created
  + resource "google_compute_target_pool" "target-pool" {
      + health_checks    = [
          + "kubernetes",
        ]
      + id               = (known after apply)
      + instances        = [
          + "australia-southeast1-a/controller-0",
        ]
      + name             = "kubernetes-target-pool"
      + project          = (known after apply)
      + region           = (known after apply)
      + self_link        = (known after apply)
      + session_affinity = "NONE"
    }

  # kubernetes_deployment.nginx will be created
  + resource "kubernetes_deployment" "nginx" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "App" = "ScalableNginxExample"
            }
          + name             = "scalable-nginx-example"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 60
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = 1
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "App" = "ScalableNginxExample"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "App" = "ScalableNginxExample"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + self_link        = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + restart_policy                   = "Always"
                  + service_account_name             = (known after apply)
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "nginx:1.7.8"
                      + image_pull_policy          = (known after apply)
                      + name                       = "example"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + port {
                          + container_port = 80
                          + protocol       = "TCP"
                        }

                      + resources {
                          + limits {
                              + cpu    = "0.5"
                              + memory = "512Mi"
                            }

                          + requests {
                              + cpu    = "250m"
                              + memory = "50Mi"
                            }
                        }

                      + volume_mount {
                          + mount_path        = (known after apply)
                          + mount_propagation = (known after apply)
                          + name              = (known after apply)
                          + read_only         = (known after apply)
                          + sub_path          = (known after apply)
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only   = (known after apply)
                          + secret_name = (known after apply)
                          + share_name  = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)
                          + volume_handle     = (known after apply)

                          + controller_expand_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + controller_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_publish_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }

                          + node_stage_secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + quantity       = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + quantity       = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }
    }

  # kubernetes_service.nginx will be created
  + resource "kubernetes_service" "nginx" {
      + id                    = (known after apply)
      + load_balancer_ingress = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "nginx-example"
          + namespace        = "default"
          + resource_version = (known after apply)
          + self_link        = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + cluster_ip                  = (known after apply)
          + external_traffic_policy     = (known after apply)
          + health_check_node_port      = (known after apply)
          + publish_not_ready_addresses = false
          + selector                    = {
              + "App" = "ScalableNginxExample"
            }
          + session_affinity            = "None"
          + type                        = "NodePort"

          + port {
              + node_port   = 30201
              + port        = 80
              + protocol    = "TCP"
              + target_port = "80"
            }
        }
    }

  # tls_cert_request.admin will be created
  + resource "tls_cert_request" "admin" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "admin"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "system:masters"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_cert_request.api-server will be created
  + resource "tls_cert_request" "api-server" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "kubernetes",
          + "kubernetes.default",
          + "kubernetes.default.svc",
          + "kubernetes.default.svc.cluster",
          + "kubernetes.svc.cluster.local",
        ]
      + id               = (known after apply)
      + ip_addresses     = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "kubernetes"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "Kubernetes"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_cert_request.controller will be created
  + resource "tls_cert_request" "controller" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "system:kube-controller-manager"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "system:kube-controller-manager"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_cert_request.proxy will be created
  + resource "tls_cert_request" "proxy" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "system:kube-proxy"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "system:node-proxier"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_cert_request.scheduler will be created
  + resource "tls_cert_request" "scheduler" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "system:kube-scheduler"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "system:kube-scheduler"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_cert_request.service-account will be created
  + resource "tls_cert_request" "service-account" {
      + cert_request_pem = (known after apply)
      + id               = (known after apply)
      + key_algorithm    = "RSA"
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name         = "service-account"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "Kubernetes"
          + organizational_unit = "Kubernetes The Hard Way"
          + province            = "NSW"
        }
    }

  # tls_locally_signed_cert.admin will be created
  + resource "tls_locally_signed_cert" "admin" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_locally_signed_cert.api-server will be created
  + resource "tls_locally_signed_cert" "api-server" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_locally_signed_cert.controller will be created
  + resource "tls_locally_signed_cert" "controller" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_locally_signed_cert.proxy will be created
  + resource "tls_locally_signed_cert" "proxy" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_locally_signed_cert.scheduler will be created
  + resource "tls_locally_signed_cert" "scheduler" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_locally_signed_cert.service-account will be created
  + resource "tls_locally_signed_cert" "service-account" {
      + allowed_uses          = [
          + "key_encipherment",
          + "server_auth",
          + "client_auth",
          + "digital_signature",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = "RSA"
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)
    }

  # tls_private_key.admin will be created
  + resource "tls_private_key" "admin" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.api-server will be created
  + resource "tls_private_key" "api-server" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.ca will be created
  + resource "tls_private_key" "ca" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.controller will be created
  + resource "tls_private_key" "controller" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.proxy will be created
  + resource "tls_private_key" "proxy" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.scheduler will be created
  + resource "tls_private_key" "scheduler" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.service-account will be created
  + resource "tls_private_key" "service-account" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_private_key.ssh-key will be created
  + resource "tls_private_key" "ssh-key" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 2048
    }

  # tls_self_signed_cert.ca will be created
  + resource "tls_self_signed_cert" "ca" {
      + allowed_uses          = [
          + "key_encipherment",
          + "cert_signing",
          + "server_auth",
          + "client_auth",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = "RSA"
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = true
      + validity_end_time     = (known after apply)
      + validity_period_hours = 8760
      + validity_start_time   = (known after apply)

      + subject {
          + common_name         = "Kubernetes"
          + country             = "AU"
          + locality            = "Sydney"
          + organization        = "Kubernetes"
          + organizational_unit = "CA"
          + province            = "NSW"
        }
    }

Plan: 40 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @zcipod, Action: `pull_request`*